In [2]:
import numpy as np
import pandas as pd

In [3]:
user_data = {
    "MarksA" :np.random.randint(1,100,5,),
    "MarksB" :np.random.randint(50,100,5),
    "MarksC" :np.random.randint(1,100,5),
}

In [4]:
user_data

{'MarksA': array([23, 80, 75, 67, 77]),
 'MarksB': array([91, 82, 91, 91, 89]),
 'MarksC': array([92, 29, 84, 48, 61])}

In [5]:
df = pd.DataFrame(user_data)

In [6]:
df

   MarksA  MarksB  MarksC
0      23      91      92
1      80      82      29
2      75      91      84
3      67      91      48
4      77      89      61

In [7]:
df.head()

   MarksA  MarksB  MarksC
0      23      91      92
1      80      82      29
2      75      91      84
3      67      91      48
4      77      89      61

In [8]:
df.head(2)

   MarksA  MarksB  MarksC
0      23      91      92
1      80      82      29

In [9]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [10]:
df.to_csv('marks.csv')

In [11]:
my_data = pd.read_csv('marks.csv')

In [12]:
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      23      91      92
1           1      80      82      29
2           2      75      91      84
3           3      67      91      48
4           4      77      89      61

In [13]:
my_data = my_data.drop(columns = ['Unnamed: 0'])

In [14]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   64.400000  88.800000  62.800000
std    23.638951   3.898718  25.820534
min    23.000000  82.000000  29.000000
25%    67.000000  89.000000  48.000000
50%    75.000000  91.000000  61.000000
75%    77.000000  91.000000  84.000000
max    80.000000  91.000000  92.000000

In [15]:
my_data.tail(3)

   MarksA  MarksB  MarksC
2      75      91      84
3      67      91      48
4      77      89      61

In [16]:
df.iloc[3]

MarksA    67
MarksB    91
MarksC    48
Name: 3, dtype: int32

In [17]:
df.iloc[3,1]

91

In [18]:
df.iloc[3][1]

91

In [19]:
idx = df.columns.get_loc('MarksB')
df.iloc[3,idx]

91

In [20]:
idx = [df.columns.get_loc('MarksB'),df.columns.get_loc('MarksC')]
df.iloc[3,idx]

MarksB    91
MarksC    48
Name: 3, dtype: int32

In [21]:
df.iloc[:3,idx]

   MarksB  MarksC
0      91      92
1      82      29
2      91      84

In [22]:
df.iloc[:3,1:3]

   MarksB  MarksC
0      91      92
1      82      29
2      91      84

In [23]:
my_data

   MarksA  MarksB  MarksC
0      23      91      92
1      80      82      29
2      75      91      84
3      67      91      48
4      77      89      61

In [26]:
my_data.sort_values(by=["MarksA"] , ascending = False)

   MarksA  MarksB  MarksC
1      80      82      29
4      77      89      61
2      75      91      84
3      67      91      48
0      23      91      92

In [27]:
my_data.sort_values(by=["MarksA"] , ascending = True)

   MarksA  MarksB  MarksC
0      23      91      92
3      67      91      48
2      75      91      84
4      77      89      61
1      80      82      29

In [28]:
my_data.sort_values(by=["MarksC","MarksA"] , ascending = False)

   MarksA  MarksB  MarksC
0      23      91      92
2      75      91      84
4      77      89      61
3      67      91      48
1      80      82      29

In [29]:
data_array = my_data.values

In [30]:
data_array

array([[23, 91, 92],
       [80, 82, 29],
       [75, 91, 84],
       [67, 91, 48],
       [77, 89, 61]], dtype=int64)

In [31]:
data_array.shape

(5, 3)

In [33]:
data_array[2][2]

84

In [36]:
new_df = pd.DataFrame(data_array,dtype = 'int32',columns = ["Physics" , "Chem" , "Maths"])

In [37]:
new_df

   Physics  Chem  Maths
0       23    91     92
1       80    82     29
2       75    91     84
3       67    91     48
4       77    89     61

In [43]:
new_df.to_csv("PCM.csv" , index = False)

In [44]:
pcm = pd.read_csv('PCM.csv')

In [45]:
pcm

   Physics  Chem  Maths
0       23    91     92
1       80    82     29
2       75    91     84
3       67    91     48
4       77    89     61